week_number = int(input("Введіть номер тижня (1 або 2): "))
day_of_week = input("Введіть день тижня (Понеділок, Вівторок, Середа, Четвер, П’ятниця): ")

if week_number == 1:
    if day_of_week.lower() == "понеділок":
        print("Розклад на понеділок, 1 тиждень: Математика, Англійська мова")
    elif day_of_week.lower() == "вівторок":
        print("Розклад на вівторок, 1 тиждень: Історія, Біологія")
    elif day_of_week.lower() == "середа":
        print("Розклад на середу, 1 тиждень: Фізика, Математика")
    elif day_of_week.lower() == "четвер":
        print("Розклад на четвер, 1 тиждень: Географія, Хімія")
    elif day_of_week.lower() == "п’ятниця":
        print("Розклад на п’ятницю, 1 тиждень: Література, Англійська мова")
    else:
        print("Невідомий день тижня")
elif week_number == 2:
    if day_of_week.lower() == "понеділок":
        print("Розклад на понеділок, 2 тиждень: Математика, Фізкультура")
    elif day_of_week.lower() == "вівторок":
        print("Розклад на вівторок, 2 тиждень: Історія, Література")
    elif day_of_week.lower() == "середа":
        print("Розклад на середу, 2 тиждень: Географія, Музика")
    elif day_of_week.lower() == "четвер":
        print("Розклад на четвер, 2 тиждень: Біологія, Математика")
    elif day_of_week.lower() == "п’ятниця":
        print("Розклад на п’ятницю, 2 тиждень: Англійська мова, Хімія")
    else:
        print("Невідомий день тижня")
else:
    print("Невідомий номер тижня")
