C = ["Товар1", "Товар2", "Товар3", "Товар4", "Товар5", "Товар6", "Товар7", "Товар8", "Товар9", "Товар10", 
     "Товар11", "Товар12", "Товар13", "Товар14", "Товар15", "Товар16", "Товар17", "Товар18", "Товар19", "Товар20"]

A = [12, 18, 7, 25, 40, 9, 14, 6, 31, 4, 16, 28, 19, 22, 35, 5, 11, 27, 13, 20]

B = [150, 90, 220, 175, 60, 340, 130, 95, 85, 760, 55, 120, 200, 160, 45, 410, 140, 70, 180, 210]

total_value = 0
for i in range(len(A)):
    total_value += A[i] * B[i]

average_price = sum(B) / len(B)
max_quantity_index = A.index(max(A))
most_stocked_product = C[max_quantity_index]

print(f"Загальна вартість: {total_value}")
print(f"Середня ціна: {average_price}")
print(f"Найбільше на складі: {most_stocked_product}")